# VectorAtPoint Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VectorAtPoint Constructor
VectorAtPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |
| VectorAtPoint(IList<(Of <<'(XYZ>)>>)) | Creates object from an array of vectors |

# See Also
VectorAtPoint Class
VectorAtPoint Members
Autodesk.Revit.DB.Analysis Namespace